src/InformationRegisters/СвободныеИнтервалыСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СвободныеИнтервалыСотрудников</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДатаВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДеньИнтервала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ВремяРаботыСотрудниковПлан.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ВремяРаботыСотрудниковПлан</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Минуты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТипРабочегоВремени</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРабочегоВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МесяцОтбор</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/СвободныеИнтервалыСотрудников/Ext/ManagerModule.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Функция, возвращает свободные интервалы.
//
// Параметры:
//  СтруктурнаяЕдиница					 - 	 - 
//  Сотрудники							 - 	 - 
//  ДлительностьИнтервала				 - 	 - 
//  НачалоПериода						 - 	 - 
//  КонецПериода						 - 	 - 
//  ПолучитьПрошедшиеПериоды			 - 	 - 
//  ПолучитьИнтервалыПослеТекущейДаты	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСвободныеИнтервалы(
	СтруктурнаяЕдиница,
	Сотрудники = Неопределено,
	ДлительностьИнтервала = Неопределено,
	НачалоПериода = Неопределено,
	КонецПериода = Неопределено,
	ПолучитьПрошедшиеПериоды = Ложь,
	ПолучитьИнтервалыПослеТекущейДаты = Ложь,
	НачалоПериодаЗапрета = Неопределено,
	КонецПериодаЗапрета = Неопределено) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СвободныеИнтервалыСотрудников.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	СвободныеИнтервалыСотрудников.Сотрудник КАК Сотрудник,
	|	ВЫБОР
	|		КОГДА НЕ &ПолучитьПрошедшиеПериоды
	|				И &ТекущаяДата > СвободныеИнтервалыСотрудников.ДатаВремяНачала
	|			ТОГДА &ТекущаяДата
	|		ИНАЧЕ СвободныеИнтервалыСотрудников.ДатаВремяНачала
	|	КОНЕЦ КАК ДатаВремяНачала,
	|	СвободныеИнтервалыСотрудников.ДатаВремяНачала КАК ДатаВремяНачалаИнтервала,
	|	ДОБАВИТЬКДАТЕ(СвободныеИнтервалыСотрудников.ДатаВремяНачала, МИНУТА, СвободныеИнтервалыСотрудников.Длительность) КАК ДатаВремяОкончания,
	|	СвободныеИнтервалыСотрудников.ДеньИнтервала КАК ДеньИнтервала,
	|	ВЫБОР
	|		КОГДА НЕ &ПолучитьПрошедшиеПериоды
	|				И &ТекущаяДата > СвободныеИнтервалыСотрудников.ДатаВремяНачала
	|			ТОГДА РАЗНОСТЬДАТ(&ТекущаяДата, ДОБАВИТЬКДАТЕ(СвободныеИнтервалыСотрудников.ДатаВремяНачала, МИНУТА, СвободныеИнтервалыСотрудников.Длительность), МИНУТА)
	|		ИНАЧЕ СвободныеИнтервалыСотрудников.Длительность
	|	КОНЕЦ КАК Длительность
	|ИЗ
	|	РегистрСведений.СвободныеИнтервалыСотрудников КАК СвободныеИнтервалыСотрудников
	|ГДЕ
	|	СвободныеИнтервалыСотрудников.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И &УсловиеСотрудник
	|	И &УсловиеДлительностьИнтервала
	|	И &УсловиеПериод
	|	И &УсловиеЗапретЗаписи
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаВремяНачала");
	
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"	 	, СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Сотрудники"		  	 	, Сотрудники);
	Запрос.УстановитьПараметр("ДлительностьИнтервала"	, ДлительностьИнтервала);
	Запрос.УстановитьПараметр("НачалоПериода"		 	, НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода"		 	, КонецПериода);
	Запрос.УстановитьПараметр("ТекущаяДата"		 	 	, ?(ЗначениеЗаполнено(НачалоПериода) И НачалоПериода > ТекущаяДатаСеанса(), НачалоПериода, ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("ПолучитьПрошедшиеПериоды", ПолучитьПрошедшиеПериоды);
	Запрос.УстановитьПараметр("НачалоПериодаЗапрета"	, НачалоПериодаЗапрета);
	Запрос.УстановитьПараметр("КонецПериодаЗапрета"		, КонецПериодаЗапрета);

	УсловиеСотрудник 			 = ?(ЗначениеЗаполнено(Сотрудники), "И СвободныеИнтервалыСотрудников.Сотрудник В (&Сотрудники)", "");
	Запрос.Текст 	 			 = СтрЗаменить(Запрос.Текст, "И &УсловиеСотрудник", УсловиеСотрудник);
	
	УсловиеДлительностьИнтервала = ?(ЗначениеЗаполнено(ДлительностьИнтервала), "И СвободныеИнтервалыСотрудников.Длительность >= &ДлительностьИнтервала", "");
	Запрос.Текст 	 			 = СтрЗаменить(Запрос.Текст, "И &УсловиеДлительностьИнтервала", УсловиеДлительностьИнтервала);
	
	УсловиеЗапретЗаписи			 = ?(ЗначениеЗаполнено(НачалоПериодаЗапрета) И ЗначениеЗаполнено(КонецПериодаЗапрета), "И Не (СвободныеИнтервалыСотрудников.ДеньИнтервала Между &НачалоПериодаЗапрета И &КонецПериодаЗапрета)", "");
	Запрос.Текст 	 			 = СтрЗаменить(Запрос.Текст, "И &УсловиеЗапретЗаписи", УсловиеЗапретЗаписи);

	Если ЗначениеЗаполнено(НачалоПериода) И ЗначениеЗаполнено(КонецПериода) Тогда
		
		УсловиеПериод = "И (СвободныеИнтервалыСотрудников.ДатаВремяНачала >= &НачалоПериода
						|		И СвободныеИнтервалыСотрудников.ДатаВремяНачала < &КонецПериода
						|	ИЛИ ДобавитьКДате(СвободныеИнтервалыСотрудников.ДатаВремяНачала, Минута, СвободныеИнтервалыСотрудников.Длительность) > &НачалоПериода
						|		И ДобавитьКДате(СвободныеИнтервалыСотрудников.ДатаВремяНачала, Минута, СвободныеИнтервалыСотрудников.Длительность) <= &КонецПериода
						|	ИЛИ СвободныеИнтервалыСотрудников.ДатаВремяНачала <= &НачалоПериода
						|		И ДобавитьКДате(СвободныеИнтервалыСотрудников.ДатаВремяНачала, Минута, СвободныеИнтервалыСотрудников.Длительность) >= &КонецПериода)
						|И ДОБАВИТЬКДАТЕ(СвободныеИнтервалыСотрудников.ДатаВремяНачала, МИНУТА, СвободныеИнтервалыСотрудников.Длительность) > &ТекущаяДата";
		
	ИначеЕсли ЗначениеЗаполнено(НачалоПериода) Тогда
		
		УсловиеПериод = "И СвободныеИнтервалыСотрудников.ДатаВремяНачала <= &НачалоПериода
					    |И ДОБАВИТЬКДАТЕ(СвободныеИнтервалыСотрудников.ДатаВремяНачала, МИНУТА, СвободныеИнтервалыСотрудников.Длительность) > &НачалоПериода
						|И ДОБАВИТЬКДАТЕ(СвободныеИнтервалыСотрудников.ДатаВремяНачала, МИНУТА, СвободныеИнтервалыСотрудников.Длительность) > &ТекущаяДата";
		
	ИначеЕсли ПолучитьПрошедшиеПериоды Тогда
		
		УсловиеПериод = "И НачалоПериода(СвободныеИнтервалыСотрудников.ДатаВремяНачала, День) < НачалоПериода(&ТекущаяДата, День)";
		
	ИначеЕсли ПолучитьИнтервалыПослеТекущейДаты Тогда
		УсловиеПериод = "И ДОБАВИТЬКДАТЕ(СвободныеИнтервалыСотрудников.ДатаВремяНачала, МИНУТА, СвободныеИнтервалыСотрудников.Длительность) > &ТекущаяДата";
	Иначе
		УсловиеПериод = "";
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &УсловиеПериод", УсловиеПериод);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Функция, возвращает таблицу максимальных интервалов по  сотрудникам.
//
// Параметры:
//  СтруктурнаяЕдиница	 - 	 - 
//  МассивСотрудников	 - 	 - 
//  ДатаСреза			 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьМаксимальныйИнтервалПоСотрудникам(СтруктурнаяЕдиница, МассивСотрудников, ДатаСреза = Неопределено) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА &ТекущаяДата > СвободныеИнтервалыСотрудников.ДатаВремяНачала
	|					И &ТекущаяДата >= &ДатаСреза
	|				ТОГДА РАЗНОСТЬДАТ(&ТекущаяДата, ДОБАВИТЬКДАТЕ(СвободныеИнтервалыСотрудников.ДатаВремяНачала, МИНУТА, СвободныеИнтервалыСотрудников.Длительность), МИНУТА)
	|			КОГДА &ДатаСреза > СвободныеИнтервалыСотрудников.ДатаВремяНачала
	|				ТОГДА РАЗНОСТЬДАТ(&ДатаСреза, ДОБАВИТЬКДАТЕ(СвободныеИнтервалыСотрудников.ДатаВремяНачала, МИНУТА, СвободныеИнтервалыСотрудников.Длительность), МИНУТА)
	|			ИНАЧЕ СвободныеИнтервалыСотрудников.Длительность
	|		КОНЕЦ) КАК МаксимальнаяДлительность,
	|	СвободныеИнтервалыСотрудников.Сотрудник КАК Сотрудник
	|ИЗ
	|	РегистрСведений.СвободныеИнтервалыСотрудников КАК СвободныеИнтервалыСотрудников
	|ГДЕ
	|	СвободныеИнтервалыСотрудников.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И СвободныеИнтервалыСотрудников.Сотрудник В(&МассивСотрудников)
	|	И ДОБАВИТЬКДАТЕ(СвободныеИнтервалыСотрудников.ДатаВремяНачала, МИНУТА, СвободныеИнтервалыСотрудников.Длительность) > &ТекущаяДата
	|	И &УсловиеДатаСреза
	|
	|СГРУППИРОВАТЬ ПО
	|	СвободныеИнтервалыСотрудников.Сотрудник");
	
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("МассивСотрудников" , МассивСотрудников);
	Запрос.УстановитьПараметр("ТекущаяДата"	  	  , ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ДатаСреза"	  	  , ?(ЗначениеЗаполнено(ДатаСреза), ДатаСреза, ТекущаяДатаСеанса()));
	
	УсловиеДатаСреза = "И СвободныеИнтервалыСотрудников.ДатаВремяНачала <= &ДатаСреза
					   |И ДОБАВИТЬКДАТЕ(СвободныеИнтервалыСотрудников.ДатаВремяНачала, МИНУТА, СвободныеИнтервалыСотрудников.Длительность) > &ДатаСреза";
	
	Запрос.Текст 	 = СтрЗаменить(Запрос.Текст, "И &УсловиеДатаСреза", ?(ЗначениеЗаполнено(ДатаСреза), УсловиеДатаСреза, ""));
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Процедура, формирует свободные интервалы сотрудников.
//
// Параметры:
//  СтруктурнаяЕдиница	 - 	 - 
//  МассивСотрудников	 - 	 - 
//  НачалоПериода		 - 	 - 
//  КонецПериода		 - 	 - 
//
Процедура СформироватьИнтервалыПоСотрудникам(
		СтруктурнаяЕдиница, 
		МассивСотрудников = Неопределено, 
		НачалоПериода = Неопределено, 
		КонецПериода = Неопределено) Экспорт
	
	ДатаСреза 		= НачалоМинуты(ТекущаяДатаСеанса()) + 60;
	МинНормаВремени = 10; // минимальный слот (10 мин)
	
	ГрафикРаботыСотрудников = ПолучитьГрафикРаботыСотрудников(МассивСотрудников, СтруктурнаяЕдиница, НачалоПериода, КонецПериода);
	
	Если ГрафикРаботыСотрудников.Количество() > 0 Тогда
		ОтборСотрудников = ГрафикРаботыСотрудников.ВыгрузитьКолонку("Сотрудник");
		
		Если ОтборСотрудников.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		ТаблицаПриемовИЗаписей = Документы.Прием.ПолучитьПриемыИЗаписиСотрудников(
			СтруктурнаяЕдиница, ОтборСотрудников,, НачалоПериода, КонецПериода);
		
	КонецЕсли;
	
	ОтборПоПериоду = ЗначениеЗаполнено(НачалоПериода) И ЗначениеЗаполнено(КонецПериода);
	
	Если ОтборПоПериоду Тогда
		
		// Очистка перезаполняемых дат.
		ОбрабатываемаяДата = НачалоДня(НачалоПериода);
		ДатаОкончания	   = НачалоДня(КонецПериода);
		
		Пока ОбрабатываемаяДата <= ДатаОкончания Цикл
			
			Для Каждого Сотрудник Из МассивСотрудников Цикл
				
				НаборЗаписей = РегистрыСведений.СвободныеИнтервалыСотрудников.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.СтруктурнаяЕдиница.Установить(СтруктурнаяЕдиница);
				НаборЗаписей.Отбор.Сотрудник.Установить(Сотрудник);
				НаборЗаписей.Отбор.ДеньИнтервала.Установить(ОбрабатываемаяДата);
				НаборЗаписей.Записать();
				
			КонецЦикла;
			
			ОбрабатываемаяДата = ОбрабатываемаяДата + 86400;
			
		КонецЦикла;
		
	КонецЕсли;
	
	МассивДобавленныхСотрудников = Новый Массив;
	ТаблицаСвободныхИнтервалов   = Новый ТаблицаЗначений;
	ТаблицаСвободныхИнтервалов.Колонки.Добавить("СтруктурнаяЕдиница");
	ТаблицаСвободныхИнтервалов.Колонки.Добавить("Сотрудник");
	ТаблицаСвободныхИнтервалов.Колонки.Добавить("ДатаВремяНачала");
	ТаблицаСвободныхИнтервалов.Колонки.Добавить("ДеньИнтервала");
	ТаблицаСвободныхИнтервалов.Колонки.Добавить("Длительность");
	
	Для Каждого СтрокаТЧ Из ГрафикРаботыСотрудников Цикл
		
		Если МассивДобавленныхСотрудников.Найти(СтрокаТЧ.Сотрудник) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СменыСотрудника = ГрафикРаботыСотрудников.НайтиСтроки(Новый Структура("Сотрудник", СтрокаТЧ.Сотрудник));
		
		Если СменыСотрудника.Количество() > 0 Тогда
			
			ПриемыСотрудника = ТаблицаПриемовИЗаписей.НайтиСтроки(Новый Структура("Сотрудник", СтрокаТЧ.Сотрудник));
			СчетчикПриемов   = 0;
			
			Для Каждого Смена Из СменыСотрудника Цикл
				
				ДатаОкончанияПредПриема = ?(Смена.ДатаВремяНачала >= ДатаСреза, Смена.ДатаВремяНачала, ДатаСреза);
				Пока СчетчикПриемов < ПриемыСотрудника.Количество() Цикл
					
					ТекущийПрием = ПриемыСотрудника[СчетчикПриемов];
					
					Если ПриемВходитВСмену(ТекущийПрием, Смена) Тогда
						
						ДлительностьОкна = ТекущийПрием.ДатаНачала - ДатаОкончанияПредПриема;
						
						Если ДлительностьОкна >= МинНормаВремени Тогда
							ДобавитьЗаписьВНаборЗаписей(
								СтруктурнаяЕдиница, 
								СтрокаТЧ.Сотрудник, 
								ДатаОкончанияПредПриема, 
								ДлительностьОкна, 
								ТаблицаСвободныхИнтервалов);
						КонецЕсли;
						
						Если ТекущийПрием.ДатаОкончания > ДатаОкончанияПредПриема Тогда
							ДатаОкончанияПредПриема = ТекущийПрием.ДатаОкончания;
						КонецЕсли;
						
					ИначеЕсли ТекущийПрием.ДатаНачала >= Смена.ДатаВремяОкончания Тогда
						Прервать;
					КонецЕсли;
					
					СчетчикПриемов = СчетчикПриемов + 1;
					
				КонецЦикла;
				
				ДлительностьОкна = Смена.ДатаВремяОкончания - ДатаОкончанияПредПриема;
				
				Если ДлительностьОкна >= МинНормаВремени Тогда
					
					ДобавитьЗаписьВНаборЗаписей(
						СтруктурнаяЕдиница, 
						СтрокаТЧ.Сотрудник, 
						ДатаОкончанияПредПриема, 
						ДлительностьОкна, 
						ТаблицаСвободныхИнтервалов);
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		МассивДобавленныхСотрудников.Добавить(СтрокаТЧ.Сотрудник);
		
	КонецЦикла;
	
	Если ТаблицаСвободныхИнтервалов.Количество() > 0 Тогда
		НаборЗаписей = РегистрыСведений.СвободныеИнтервалыСотрудников.СоздатьНаборЗаписей();
		НаборЗаписей.Загрузить(ТаблицаСвободныхИнтервалов);
		НаборЗаписей.Записать(Ложь);
	КонецЕсли;
	
КонецПроцедуры

// Процедура, добавляет запись в набор записей регистра.
//
// Параметры:
//  СтруктурнаяЕдиница			 - 	 - 
//  Сотрудник					 - 	 - 
//  ДатаВремяНачалаОкна			 - 	 - 
//  ДлительностьОкна			 - 	 - 
//  ТаблицаСвободныхИнтервалов	 - 	 - 
//
Процедура ДобавитьЗаписьВНаборЗаписей(
		СтруктурнаяЕдиница, 
		Сотрудник, 
		ДатаВремяНачалаОкна, 
		ДлительностьОкна, 
		ТаблицаСвободныхИнтервалов)
	
	СтруктураПоиска = Новый Структура("ДатаВремяНачала, СтруктурнаяЕдиница, Сотрудник, ДеньИнтервала", НачалоМинуты(ДатаВремяНачалаОкна), СтруктурнаяЕдиница, Сотрудник, НачалоДня(ДатаВремяНачалаОкна));
	
	Если ТаблицаСвободныхИнтервалов.НайтиСтроки(СтруктураПоиска).Количество() = 0 Тогда
		
		НоваяСтрока 				   = ТаблицаСвободныхИнтервалов.Добавить();
		НоваяСтрока.СтруктурнаяЕдиница = СтруктурнаяЕдиница;
		НоваяСтрока.Сотрудник 		   = Сотрудник;
		НоваяСтрока.ДатаВремяНачала	   = НачалоМинуты(ДатаВремяНачалаОкна);
		НоваяСтрока.ДеньИнтервала	   = НачалоДня(ДатаВремяНачалаОкна);
		НоваяСтрока.Длительность	   = Цел(ДлительностьОкна / 60);
		
	КонецЕсли;
	
КонецПроцедуры

// Функция, возвращает смены сотрудников, минимальную длительность услуги сотрудника.
//
// Параметры:
//  МассивСотрудников	 - 	 - 
//  СтруктурнаяЕдиница	 - 	 - 
//  НачалоПериода		 - 	 - 
//  КонецПериода		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьГрафикРаботыСотрудников(
		МассивСотрудников, 
		СтруктурнаяЕдиница, 
		НачалоПериода = Неопределено, 
		КонецПериода = Неопределено, 
		ДниИнтервалов = Неопределено) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВремяРаботыСотрудниковПлан.Сотрудник КАК Сотрудник,
	|	ВремяРаботыСотрудниковПлан.ДатаВремяНачала КАК ДатаВремяНачала,
	|	ВремяРаботыСотрудниковПлан.ДатаВремяОкончания КАК ДатаВремяОкончания
	|ИЗ
	|	РегистрСведений.ВремяРаботыСотрудниковПлан КАК ВремяРаботыСотрудниковПлан
	|ГДЕ
	|	ВремяРаботыСотрудниковПлан.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И НЕ ВремяРаботыСотрудниковПлан.Сотрудник.ЭтоГруппа
	|	И НЕ ВремяРаботыСотрудниковПлан.Сотрудник.ПометкаУдаления
	|	И &УсловиеВремяСмены
	|	И &УсловиеМассивСотрудников
	|
	|СГРУППИРОВАТЬ ПО
	|	ВремяРаботыСотрудниковПлан.Сотрудник,
	|	ВремяРаботыСотрудниковПлан.ДатаВремяНачала,
	|	ВремяРаботыСотрудниковПлан.ДатаВремяОкончания
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаВремяНачала");
	
	Запрос.УстановитьПараметр("МассивСотрудников" , МассивСотрудников);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("НачалоПериода"     , НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода"      , КонецПериода);
	Запрос.УстановитьПараметр("ДниИнтервалов"     , ДниИнтервалов);
	
	УсловиеМассивСотрудников = ?(ЗначениеЗаполнено(МассивСотрудников), " И ВремяРаботыСотрудниковПлан.Сотрудник В (&МассивСотрудников) ", "");
	Запрос.Текст             = СтрЗаменить(Запрос.Текст, "И &УсловиеМассивСотрудников", УсловиеМассивСотрудников);
	
	Если ЗначениеЗаполнено(НачалоПериода) И ЗначениеЗаполнено(КонецПериода) Тогда
		
		УсловиеВремяСмены = "И ((ВремяРаботыСотрудниковПлан.ДатаВремяНачала >= &НачалоПериода
						    |И ВремяРаботыСотрудниковПлан.ДатаВремяНачала < &КонецПериода)
						    |ИЛИ (ВремяРаботыСотрудниковПлан.ДатаВремяОкончания > &НачалоПериода
						    |И ВремяРаботыСотрудниковПлан.ДатаВремяОкончания <= &КонецПериода)
							|ИЛИ (ВремяРаботыСотрудниковПлан.ДатаВремяНачала <= &НачалоПериода
						    |И ВремяРаботыСотрудниковПлан.ДатаВремяОкончания >= &КонецПериода))";
	ИначеЕсли ЗначениеЗаполнено(ДниИнтервалов) Тогда
		УсловиеВремяСмены = "И НачалоПериода(ВремяРаботыСотрудниковПлан.ДатаВремяНачала, День) В (&ДниИнтервалов)"
	КонецЕсли;
	
	Запрос.Текст          = СтрЗаменить(Запрос.Текст, "И &УсловиеВремяСмены", УсловиеВремяСмены);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Функция, проверяет, входит ли прием в смену.
//
// Параметры:
//  Визит	 - 	 - 
//  Смена	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПриемВходитВСмену(Прием, Смена)
	
	Если (Прием.ДатаНачала >= Смена.ДатаВремяНачала
		И Прием.ДатаНачала < Смена.ДатаВремяОкончания)
		ИЛИ (Прием.ДатаОкончания > Смена.ДатаВремяНачала
		И Прием.ДатаОкончания <= Смена.ДатаВремяОкончания) Тогда
		
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти
